import pickle

ds = {
    '北京市':
        {
            '海淀区': {
                '魏公村': {
                    '76中',
                    '广医一院'
                },
                '西村': {
                    '帝景苑'
                },
            },
            '朝阳区': {
                '北京路': {
                    '广百百货',
                    '新大新百货'
                },
                '西三旗': {
                    '政府机关',
                },
                '东风路': {
                    '正骨医院',
                    '纪念堂',
                }
            },
        },
    '上海市':
        {
            '浦东新区': {
                '塘桥街道',
                '南码头路街道',
            }
        },
}

if __name__ == '__main__':
    with open('data.pickle', 'wb') as f:
        f.write(pickle.dumps(ds))
